#Задача 2: Найдите сумму цифр трехзначного числа.
#*Пример:*
#123 -> 6 (1 + 2 + 3)
#100 -> 1 (1 + 0 + 0)

while True:
    a= int(input("Введите трехзначное число "))
    if a >99 and a <1000:
        break
def sum():
    b = int(a/100) + int(a/10%10) + a%10
    return b
print(sum())
